### 7. 데이터 정리 및 준비

### 7.1 결측 데이터
- NaN (Not a Number): float64 데이터 타입에서 결측값을 나타내는 데 사용되는 sentinel 값.
- NA (Not Available): pandas는 R 프로그래밍 언어의 관례를 따라 결측 데이터를 NA로 참조, 데이터가 존재하지 않거나 관찰되지 않았음을 의미. Python의 None 값 또한 NA로 처리
- isna: 결측값(NA)을 나타내는 불리언 시리즈를 반환.
- notna: isna의 반대로, NA가 아닌 값에 대해 True를 반환.
- dropna: 결측 데이터가 있는 축 레이블을 필터링. 
- Series: non-null 데이터와 인덱스 값만 반환.
- DataFrame: 결측값이 포함된 행 또는 열을 제거. how="all"을 사용하면 모든 값이 NA인 행만 제거.
  - axis="columns"를 사용하여 열을 제거할 수 있음.
  - thresh 인수를 사용하여 특정 개수 이상의 유효한 값을 가진 행만 유지할 수 있음.
- fillna: 결측값을 특정 값으로 채우거나 보간 방법(예: ffill, bfill)을 사용하여 채움. 
  - dictionary를 사용하여 각 열에 다른 채우기 값을 지정.
  - 보간 방법은 method 인수를 통해 지정하고, limit 인수를 사용하여 연속적으로 채울 최대 기간을 설정.
  - 평균이나 중간값과 같은 통계값을 사용하여 결측값을 채울 수도 있음.

In [5]:
import pandas as pd
import numpy as np

In [6]:
# np.nan : float64 타입의 결측값
float_data = pd.Series([1.2, -3.8, np.nan, 0])
float_data

0    1.2
1   -3.8
2    NaN
3    0.0
dtype: float64

In [8]:
# 결측치 확인
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [11]:
float_data = pd.Series([1, 2, None], dtype = 'float64')
print(float_data)
print(float_data.isna())

0    1.0
1    2.0
2    NaN
dtype: float64
0    False
1    False
2     True
dtype: bool

-  표 7.1: NA 처리 객체 메서드

|방법|    설명|
---- |-------
dropna|    각 레이블의 값에 누락된 데이터가 있는지 여부에 따라 축 레이블을 필터링하며, 허용할 누락 데이터 양에 대한 임계값을 다양하게 설정.
fillna|    누락된 데이터를 일부 값으로 채우거나 "ffill" 또는 "bfill"과 같은 보간법을 사용 .
isna|    누락된 값/NA 값을 나타내는 부울 값을 반환.
notna|    isna와 반대. NA가 아닌 값에 True, NA 값에는 False

- data.dropna(how="all") → 모든 값이 NaN인 행 삭제
- data.dropna(how="all", axis=1) → 모든 값이 NaN인 열 삭제
- how="all" → 모든 값이 NaN일 때만 삭제
- how="any" → 하나라도 NaN이 있으면 삭제

In [12]:
# na값 제거 후 반환
float_data.dropna()

0    1.0
1    2.0
dtype: float64

In [14]:
# na가 아닌 값은 True로 반환
float_data.notna()

0     True
1     True
2    False
dtype: bool

In [17]:
# na 값 확인 후 True인 데이터들 출력
float_data[float_data.notna()]

0    1.0
1    2.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], 
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data.dropna() # na값이 하나라도 있으면 행까지 같이 삭제된다

     0    1    2
0  1.0  6.5  3.0

In [24]:
# 모든값이 NaN일때 삭제
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
# 'data'에 모든값이 NaN인 열을 추가
data[3] = np.nan
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
# 축=열 을 기준으로 모든 값이 NaN인 열 삭제
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [32]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0 -0.214840 -0.414090 -0.433219
1 -0.273340  0.343957 -2.281061
2 -1.605518  1.380857  0.842863
3  1.982228 -1.659919 -0.511820
4 -1.283919  0.330224 -1.921639
5 -0.307669 -2.790130  1.394687
6  0.709240 -0.525030 -0.260526

In [37]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.214840       NaN       NaN
1 -0.273340       NaN       NaN
2 -1.605518       NaN  0.842863
3  1.982228       NaN -0.511820
4 -1.283919  0.330224 -1.921639
5 -0.307669 -2.790130  1.394687
6  0.709240 -0.525030 -0.260526

In [38]:
df.dropna()

          0         1         2
4 -1.283919  0.330224 -1.921639
5 -0.307669 -2.790130  1.394687
6  0.709240 -0.525030 -0.260526

In [53]:
# thresh 매개변수는 특정 행 또는 열이 유지되기 위해 필요한 최소한의 비결측값(non-NaN) 개수를 지정
# Nan 값이 2 미만이면 삭제
df.dropna(thresh=2)

          0         1         2
2 -1.605518       NaN  0.842863
3  1.982228       NaN -0.511820
4 -1.283919  0.330224 -1.921639
5 -0.307669 -2.790130  1.394687
6  0.709240 -0.525030 -0.260526

In [54]:
# fillna로 결측값 채우기
df.fillna(0)

          0         1         2
0 -0.214840  0.000000  0.000000
1 -0.273340  0.000000  0.000000
2 -1.605518  0.000000  0.842863
3  1.982228  0.000000 -0.511820
4 -1.283919  0.330224 -1.921639
5 -0.307669 -2.790130  1.394687
6  0.709240 -0.525030 -0.260526

In [55]:
# 딕셔너리로 값을 주어 각 열마다 해당 숫자로 채우기
df.fillna({1: 0.5, 2: 0}) # 컬럼 1은 0.5, 컬럼 2는 0

          0         1         2
0 -0.214840  0.500000  0.000000
1 -0.273340  0.500000  0.000000
2 -1.605518  0.500000  0.842863
3  1.982228  0.500000 -0.511820
4 -1.283919  0.330224 -1.921639
5 -0.307669 -2.790130  1.394687
6  0.709240 -0.525030 -0.260526

In [56]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -0.539475 -0.253032  0.664073
1  1.053691  1.012066 -0.888914
2  0.798151       NaN  0.294385
3 -0.335146       NaN  0.733467
4 -1.459880       NaN       NaN
5  0.679212       NaN       NaN
6 -0.347369       NaN       NaN

In [58]:
df.ffill() # NaN값을 해당의 앞의 값으로 채워줌

          0         1         2
0 -0.539475 -0.253032  0.664073
1  1.053691  1.012066 -0.888914
2  0.798151  1.012066  0.294385
3 -0.335146  1.012066  0.733467
4 -1.459880  1.012066  0.733467
5  0.679212  1.012066  0.733467
6 -0.347369  1.012066  0.733467

In [60]:
df.ffill(limit=2) # 2개만 ffiil

          0         1         2
0 -0.539475 -0.253032  0.664073
1  1.053691  1.012066 -0.888914
2  0.798151  1.012066  0.294385
3 -0.335146  1.012066  0.733467
4 -1.459880       NaN  0.733467
5  0.679212       NaN  0.733467
6 -0.347369       NaN       NaN

In [61]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean()) # 데이터의 평균 값으로 NaN값 채우기

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

- 표 7.2: fillna함수 인수

인수|    설명
|----|------|
value|    누락된 값을 채우는 데 사용할 스칼라 값이나 딕셔너리 형식의 객체
method|    보간 방법: "bfill"(후방 채우기) 또는 "ffill"(전방 채우기), 기본값은 None
axis|    채울 축( "index"또는 "columns"), 기본값은 axis="index"
limit|    전방 및 후방 채우기의 경우 몇개까지 채울지 지정

### 7.2 데이터 변형
- 이상치 감지 및 필터링 : any, np.sign을 사용하여 값의 부호를 기반으로 값 설정
- 셔플과 임의 샘플링 : np.random.permutation
- 생성된 순서 배열을 기반으로 선택 : take, iloc
- 중복확인 : duplicated
- 중복제거 : drop_duplicates
- 값 치환하기 : replace
- 함수 또는 매핑을 사용한 데이터 변환 : map
- 축 인덱스 이름 변경 : rename
- 데이터 분할 및 구간화
- pandas.cut : 지정된 구간(bins)에 따라 나눔
- pandas.qcut : 샘플 분위수를 기준으로 데이터를 나눔

## 7.2.1 중복 제거하기

In [63]:
# 데이터 중복 제거
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [66]:
# 각 행 별 중복 확인
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [67]:
# 중복 제거
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [69]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [71]:
# k1을 기준으로 중복 확인 후 삭제
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [74]:
# k1과 k2를 기준으로 중복 확인 후 마지막 부분은 남기기
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 7.2.2 함수나 매핑을 이용해서 데이터 변형하기

In [75]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [76]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [78]:
data['animal'] = data['food'].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [79]:
def get_animal(x):
    return meat_to_animal[x]

data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 7.2.3 값 치환하기
- 값 대체: 값 대체는 결측값 채우기의 일반적인 경우이며, replace 메서드를 사용하여 값을 대체
  - 단일 값 또는 값 리스트를 NA값으로 대체
  - 대체 값에 대한 딕셔너리를 사용할 수도 있음

In [80]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [83]:
# -999를 NaN값으로 대체하기
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [87]:
# -999와 -1000를 NaN으로 변경
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [86]:
# -999은 NaN으로 변경하고 -1000은 0으로 변경
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [92]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 7.2.4 축 인덱스 이름 바꾸기
- 축 레이블을 함수 또는 매핑을 사용하여 변환하거나, 새로운 레이블을 가진 객체를 만들 수 있음
- rename : 인덱스 또는 열 이름을 변경하며, 딕셔너리를 사용하여 일부 레이블만 변경 할 수 있음

In [94]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [98]:
# 인덱스를 대문자로 바꿔주는 함수
def transform(x):
    return x.upper()

data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [102]:
# 인덱스를 대문자로 바꾸고 앞의 4글자만 출력
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [104]:
# 인덱스를 변화한 값으로 교체하여 적용
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [107]:
# rename : 인덱스 또는 열 이름을 변경
data.rename(index=str.title, columns=str.upper) #str.title : 문자의 첫 글자를 대문자로 바꿔줌

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [110]:
# 딕셔너리를 사용하여 변경
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### 7.2.5 이산화
- 데이터 분할 및 구간화 (Discretization and Binning): 연속적인 데이터를 분석을 위해 구간으로 나눔. 
  - pandas.cut: 지정된 구간(bins)에 따라 데이터를 나눔. 
  - 결과로 나오는 Categorical 객체는 각 구간을 나타내는 Interval 값 유형을 가짐.
  - 구간 레이블을 사용자 정의할 수 있음.
  - 명시적인 구간 경계 대신 정수 개수의 구간을 전달하여 동일 길이의 구간을 만들 수 있음.
  - pandas.qcut: 샘플 분위수를 기준으로 데이터를 나눔. 이를 통해 각 구간이 거의 동일한 수의 데이터 포인트를 갖게 됨.

In [133]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [134]:
# 나이 데이터를 연령대 별로 나누는 예시 (18~25, 26~35, 36~60, 61~100)
# 결과로 나오는 Categorical 객체는 각 구간을 나타내는 Interval 값 유형을 가짐
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories
# Length: 갯수
# Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]] 4구간을 알려줌

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [135]:
age_categories.codes # 각 구간중 어디에 해당하는지 알 수 있음

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [136]:
age_categories.categories # 카테고리 표시
age_categories.categories[0]

Interval(18, 25, closed='right')

In [137]:
# 연령별 빈도 수 보기
# ( 포함안됨
# ] 포함됨
pd.value_counts(age_categories)

C:\Users\402\AppData\Local\Temp\ipykernel_6000\1169886498.py:4: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [138]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [140]:
# 구간을 연령대 이름 열로 지정해보기
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [143]:
# 데이터를 4개의 구간으로 나누기 (사분위수)
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2) # precision 소수점 자리 표시
quartiles
pd.Series(quartiles).value_counts()

(-3.55, -0.74]     250
(-0.74, 0.0088]    250
(0.0088, 0.72]     250
(0.72, 3.25]       250
Name: count, dtype: int64

In [147]:
# 구간을 설정하여 사분위수로 구간 나누기
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.54, -1.31]      100
(-1.31, 0.00883]    400
(0.00883, 1.288]    400
(1.288, 3.249]      100
Name: count, dtype: int64

#### 7.2.6 이상치를 찾고 제외하기
- 이상치 감지 및 필터링: 절대값이 특정 임계값을 초과하는 값을 필터링하거나 변형.
- 절대값 기준으로 이상치를 감지하고, any 메서드를 사용하여 임계값을 초과하는 값을 가진 행을 선택.
- np.sign을 사용하여 값의 부호를 기반으로 값을 설정.

In [178]:
# DataFrame에 대해 기술 통계 출력
data = pd.DataFrame(np.random.standard_normal((1000,4)))
print(data)
data.describe() # 여러가지 통계 수치를 표기

            0         1         2         3
0    0.733568  1.326405  0.711865 -0.715589
1    0.271482 -0.887125  1.626180  1.195732
2    0.993819  1.450231  2.331751 -0.365165
3    0.223830 -0.918713 -0.081836  0.782026
4   -0.158019  0.200765 -1.799659  2.312971
..        ...       ...       ...       ...
995  0.888599 -0.588903 -0.383430 -0.427858
996  1.531670 -0.335245  1.785295  1.482360
997  0.825081  0.335920 -0.879917 -1.272893
998  0.453886  0.919876 -0.601874 -0.225427
999  0.277671 -1.424683 -1.010796 -0.306090

[1000 rows x 4 columns]

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.006418     0.023702     0.003502    -0.006673
std       1.002987     1.016829     1.024238     1.009776
min      -2.713965    -2.965278    -3.135560    -2.673330
25%      -0.668284    -0.692222    -0.717981    -0.723266
50%       0.034231     0.021668    -0.005119     0.021612
75%       0.681865     0.727318     0.695586     0.671200
max       3.265372     2.725161     3.035755     3.203248

In [179]:
col = data[2] # 2열 가져오기
col[col.abs() > 3] # 절대값이 3보다 큰 수를 출력

94     3.035755
227   -3.135560
560   -3.104285
Name: 2, dtype: float64

In [180]:
# 칼럼(열)에서 조건(절대값이 3보다 큰 수)를 찾아 하나라도 있으면(any) 출력하기
data[(data.abs() > 3).any(axis=1)]

            0         1         2         3
5    3.059149 -1.118940  0.235017  0.309821
94  -0.201599 -0.907045  3.035755 -1.076789
227  0.805112 -1.161959 -3.135560 -1.917544
329  0.170882 -0.907493  1.424790  3.125640
560  0.460406 -0.641091 -3.104285 -0.360133
690 -0.967008 -0.574787 -0.329362  3.203248
770  3.265372  0.791058 -1.052895 -1.004921

In [181]:
# 값이 -이면 -1.0 +이면 1.0 으로 표시 해줌 (sign)
np.sign(data)

       0    1    2    3
0    1.0  1.0  1.0 -1.0
1    1.0 -1.0  1.0  1.0
2    1.0  1.0  1.0 -1.0
3    1.0 -1.0 -1.0  1.0
4   -1.0  1.0 -1.0  1.0
..   ...  ...  ...  ...
995  1.0 -1.0 -1.0 -1.0
996  1.0 -1.0  1.0  1.0
997  1.0  1.0 -1.0 -1.0
998  1.0  1.0 -1.0 -1.0
999  1.0 -1.0 -1.0 -1.0

[1000 rows x 4 columns]

In [182]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3  1.0 -1.0 -1.0  1.0
4 -1.0  1.0 -1.0  1.0

In [183]:
data.head()

          0         1         2         3
0  0.733568  1.326405  0.711865 -0.715589
1  0.271482 -0.887125  1.626180  1.195732
2  0.993819  1.450231  2.331751 -0.365165
3  0.223830 -0.918713 -0.081836  0.782026
4 -0.158019  0.200765 -1.799659  2.312971

In [184]:
# data의 절대값 3보다 큰 값을 부호를 바꾸고(sign) 3을 곱해서 출력
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.006093     0.023702     0.003706    -0.007002
std       1.001980     1.016829     1.023414     1.008767
min      -2.713965    -2.965278    -3.000000    -2.673330
25%      -0.668284    -0.692222    -0.717981    -0.723266
50%       0.034231     0.021668    -0.005119     0.021612
75%       0.681865     0.727318     0.695586     0.671200
max       3.000000     2.725161     3.000000     3.000000

### 7.2.7 뒤섞기와 임의 샘플링
- 순열 및 임의 샘플링 : Series 또는 DataFrame의 행을 임의로 재정렬
- np.random.permutation을 사용
- take나 iloc 에서 사용 가능

In [185]:
df = pd.DataFrame(np.arange(5*7).reshape(5,7))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [187]:
# 5개 뒤섞기
sampler = np.random.permutation(5)
sampler

array([2, 0, 1, 3, 4], dtype=int32)

In [192]:
df.take(sampler)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [194]:
df.iloc[sampler]

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [201]:
col_sampler = np.random.permutation(7)
col_sampler

array([1, 0, 6, 5, 4, 2, 3], dtype=int32)

In [203]:
# 열을 기준으로 뒤섞음
df.take(col_sampler, axis=1)

    1   0   6   5   4   2   3
0   1   0   6   5   4   2   3
1   8   7  13  12  11   9  10
2  15  14  20  19  18  16  17
3  22  21  27  26  25  23  24
4  29  28  34  33  32  30  31

In [204]:
df.sample(n=3)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

In [208]:
# 값을 반복하여 샘플링하기
choices = pd.Series([5, -1, 7, 6, 4])
choices.sample(n=10, replace=True) # 무작위로 10개를 선택하고, 값의 중복을 허용

0    5
0    5
1   -1
4    4
1   -1
3    6
2    7
0    5
1   -1
3    6
dtype: int64

### 7.2.8 표시자, 더미 변수 계산하기
- 더미 변수 : 0과 1로 변환 된 변수 (ex 남:0, 여:1)
- 표시자/더미 변수 계산 : 범주형 변수를 더미 또는 표시자 행렬로 변환
- pd.get_dummies : 범주형 데이터를 one-hot 인코딩 된 DataFrame으로 변환
- 여러 범주에 속하는 행의 경우, str.get_dummies 메서드를 사용하여 구분된 문자열에서 더미 변수를 만들 수 있음
- pandas.cut과 함께 pd.get_dummies를 사용하여 데이터 구간을 더미 변수로 변환

In [209]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [210]:
pd.get_dummies(df['key'], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [216]:
# prefix= 접두어를 입력하여 줄 수 있다
dummies = pd.get_dummies(df['key'], dtype=float, prefix='key')
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

In [217]:
# 원본 DataFrame과 더미 변수를 결합하기
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [219]:
# 여러 범주에 속하는 행의 경우, str.get_dummies 메서드를 사용하여 구분된 문자열에서 더미 변수를 만들 수 있음
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [225]:
# 더미데이터를 생성하여 장르를 확인하기
dummies = movies['genres'].str.get_dummies('|')
dummies.iloc[:10, :10]

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir
0,0,0,1,1,1,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0
2,0,0,0,0,1,0,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0
4,0,0,0,0,1,0,0,0,0,0
5,1,0,0,0,0,1,0,0,0,0
6,0,0,0,0,1,0,0,0,0,0
7,0,1,0,1,0,0,0,0,0,0
8,1,0,0,0,0,0,0,0,0,0
9,1,1,0,0,0,0,0,0,0,0

In [226]:
# 원본 movies DataFrame에 더미 변수(장르)에 해당하는 열 이름 'Genre_' 추가하기

In [230]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[:2]

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0,1,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0

In [232]:
# 값들을 구간으로 나누고 더미 변수로 변환
np.random.seed(12345) # 반복 가능한 예제를 위해 난수 시드 생성
values = np.random.uniform(size=10) # 균등 분포 난수 10개 생성
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [233]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

### 7.5 범주형 데이터

In [236]:
values = pd.Series(['apple', 'orange', 'apple', 'apple'] *2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [237]:
# 고유값 뽑기
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [238]:
# 값의 빈도수 계산
pd.Series(values).value_counts()

apple     6
orange    2
Name: count, dtype: int64

In [239]:
values = pd.Series([0, 1, 0, 0] *2)
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [241]:
dim = pd.Series(['apple', 'orange'])
dim

0     apple
1    orange
dtype: object

In [242]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [246]:
fruits = ['apple', 'orange', 'apple', 'orange'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=12345)

In [247]:
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3  orange      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7  orange     11  3.795525

In [250]:
fruit_cate = df['fruit'].astype('category') # dtype을 category로 변경
fruit_cate # 카테고리가 2개 표시

0     apple
1    orange
2     apple
3    orange
4     apple
5    orange
6     apple
7    orange
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [251]:
c = fruit_cate.array
type(c)

pandas.core.arrays.categorical.Categorical

In [252]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [254]:
c.codes # 0: apple, 1: orange

array([0, 1, 0, 1, 0, 1, 0, 1], dtype=int8)

In [255]:
dict(enumerate(c.categories)) # c.categories를 enumerate로 반환하여 딕셔너리 형태로 변환

{0: 'apple', 1: 'orange'}

In [256]:
# DataFrame의 fruit 열을 다시 범주형 데이터로 변환하기
df['fruit']=df['fruit'].astype('category')
df['fruit']

0     apple
1    orange
2     apple
3    orange
4     apple
5    orange
6     apple
7    orange
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']